[{"name":"PREDRAG ANIC\r","position":"PARTNER","practice":"Civil Litigation, Employment Law","bio":["Predrag is an excellent litigator with broad industry knowledge.\r","Predrag has extensive litigation experience and practises predominantly in the areas of dispute resolution, including administrative law, commercial and civil litigation (specifically general contract disputes, major construction litigation, foreclosure, personal injury and other tort claims), human rights, employment and privacy law. He has appeared before all levels of court in Alberta as well as the Labour Relations Board, the Alberta Human Rights Commission and numerous other administrative boards, and he has also provided counsel before many professional associations and tribunals.\r","Predrag was born in Ljubuski, Bosnia & Hercegovina but has called Calgary home for most of his life. He is proud of his heritage and endeavours to maintain his fluency in his native Croatian language. Predrag enjoys volleyball, ice hockey, golf and any water sports involving a boat. When he has time off, he spends summers on Sylvan Lake and escapes in the winter to Las Vegas."],"contact":"panic@milesdavison.com\r\n403. 266.7627\r\ndownload vCard","education":["University of Alberta Law School, LL.B.\r","Admitted to the Alberta Bar in 1994\r"],"experience":["Past Honorary Counsel, Canadian Cancer Society\r"]},{"name":"HALLEY AUGER\r","position":"ASSOCIATE","practice":"Civil Litigation, Real Estate, Employment Law, Estate Litigation","bio":["Halley is an adept litigator who focuses on results.\r","The first step for Halley on any case is to perform a cost/benefit analysis for her clients. Helping her clients understand both the upside and the downside of any potential legal action ensures there are no surprises along the way. She is relentlessly organized and efficient, which is undoubtedly the reason her clients continue to sing her praises long after cases are complete.\r","Halley's general litigation practice focuses on contract disputes, employment matters, personal injury and other tort claims. She also provides advice and counsel on residential landlord and tenant matters, helping landlords and property management companies understand the legal frameworks in which they operate.\r","Outside of work, Halley is both a golfer and golf-enthusiast. She loves cycling, is a wine aficionado, and can cut a mean rug on the dance floor. In her most recent endeavour she took up sewing and has since crafted a multitude of plush toys for her dog."],"contact":"hauger@milesdavison.com\r\n403.298.0309\r\ndownload vCard","education":["University of Windsor Law School, J.D.\r","Admitted to the Alberta Bar in 2015\r"],"experience":["Instructor of Landlord and Tenant Rights, Chinook College Learning Services\r"]},{"name":"QUITA BRUNT\r","position":"ASSOCIATE","practice":"Business Law, Real Estate, Wills & Estates","bio":["Quita is a client focused business lawyer.\r","For Quita, understanding her clients’ business and goals is one of the most important aspects of her work. By understanding her clients’ objectives, she can provide them with the guidance they need to achieve their goals.\r","Quita’s primary area of practice is business law. She assists businesses with the full range of their legal needs, including advising on corporate structures, shareholders’ agreements, commercial leases, employment matters, and share and asset sales and purchases. On the real estate side of her practice, Quita focuses on commercial real estate and mortgage lending. She also has experience in employment law and wills and estates. Her broad experience helps to inform her work, giving her a well-rounded perspective on all legal matters.\r","Out of the office, Quita can be found cooking or gardening with her son. She also loves fitness and travelling. Some of her favourite spots include Australia, France and Bali."],"contact":"qbrunt@milesdavison.com\r\n403.266.7624\r\ndownload vCard","education":["Bond University Law School, 2010 J.D. (First Class Honours)\r","University of Calgary, 2005, B.A. (Hons)\r","Admitted to the Alberta Bar in 2012\r"],"experience":["Treasurer of the Riverbend Calgary Youth Justice Board\r"]},{"name":"GREG CHASE \r","position":"ASSOCIATE","practice":"Civil Litigation","bio":["A former high school English teacher, Greg joined Miles Davison in 1983 and has practiced with the firm ever since. \r","Greg’s primary area of practice is civil litigation – particularly in the areas of oil and gas, professional negligence, products liability and construction. His love of the English language combined with his ability to instigate sophisticated data management solutions make him especially adept at managing document-intensive lawsuits. \r","Greg is a proud father of four children with five grandchildren and counting. He is an ardent supporter of both the Calgary Flames and the Stampeders and his love of sport extends to golf – where he is trying to hone his skills. Greg is an avid reader and when he is not having fun with his grandchildren, you can find him cooking or making the most of Calgary’s short gardening season."],"contact":"gchase@milesdavison.com\r\n403.298.0318\r\ndownload vCard","education":["University of Calgary, 1976, B.Ed.\r","University of Calgary, 1973, LL.B.\r","Admitted to the Alberta Bar in 1983\r"],"experience":["Professional and Community Experience\r","Member, Canadian Bar Association, Civil Litigation and Aboriginal Law Section\r","Member, Law Society of Alberta\r"]},{"name":"JASON COLLINS\r","position":"ASSOCIATE","practice":"Business Law, Real Estate","bio":["Jason is a detail-oriented lawyer with the tenacity to persist in difficult circumstances.\r","Attention to detail is critically important for Jason, as it allows him to thoroughly identify his clients’ needs and areas of risk. He works towards cooperation between parties whenever possible but does have extensive experience in difficult contract negotiations, and isn’t timid when it comes to ensuring his clients’ needs are met.\r","Jason has a corporate commercial practice that focuses on banking, debt financing, corporate reorganizations, share and asset acquisitions and dispositions, cross border financial transactions, commercial contracts and general corporate and commercial matters. He has a keen interest in helping clients who are entrepreneurs and regularly provides advice and services for startup businesses.\r"," When he’s not helping his clients solve problems, Jason can likely be found participating in some sort of sporting activity. A college baseball player, he still enjoys weekends at the baseball diamond as well as hockey, volleyball and basketball. He enjoys water skiing in summer and alpine skiing in winter, and is also an avid hiker. Jason is also an experienced traveler, having spent significant time in Europe as well as Central and South America."],"contact":"jcollins@milesdavison.com\r\n403.298.0382\r\ndownload vCard","education":["McMaster University, 2008, B.A. (Honours)\r","University of Calgary, 2013, J.D.\r","Admitted to the Alberta Bar in 2014\r"],"experience":["Member, Law Society of Alberta\r"]},{"name":"TERRY CZECHOWSKYJ\r","position":"PARTNER","practice":"Civil Litigation, Insolvency","bio":["As a managing partner and one of the country’s pre-eminent voices on insolvency, Terry brings a wealth of experience to the firm and his clients. \r","Terry is a collaborator by nature. His first aim is always to find common ground and resolve issues as effectively as possible. That said, over his career there have been more than a few times when consensus was not able to be reached. In those instances Terry doesn’t hesitate to take those matters to court. He has been lead council on more than 50 reported trial and appeal decisions.\r","An experienced litigator and one of the most well-versed lawyers in Canada on insolvency matters, Terry has represented receivers, trustees in bankruptcy, creditors and financial institutions. In 2007 he was called upon by the Federal Department of Justice to assist the United Nations Working Group on insolvency regarding cross border issues, which continues to the present day.\r","When he’s not in the office, Terry is likely lacing up his runners and hitting the pavement. An avid runner he has participated in a variety of races from 10km to marathons across the country. He’s always looking for new adventures, and loves to travel."],"contact":"tczech@milesdavison.com\r\n403.298.0326\r\ndownload vCard","education":["University of Alberta Law School, LL.B.\r","Admitted to the Alberta Bar in 1985\r"],"experience":["Department of Justice to the United Nations working group\r","Best Lawyers in Canada 2011-2015\r"]},{"name":"COREY DAVISON \r","position":"ASSOCIATE","practice":"Insolvency, Civil Litigation, Wills & Estates","bio":["Corey has had a passion for law ever since she could remember.\r","Having grown up around lawyers, she’s no stranger to the level of focus and commitment that comes with practicing law. Corey understands the importance of teamwork, and works collaboratively with her colleagues to provide legal advice, direction and service for her clients.\r","Corey has developed a civil litigation practice that focuses primarily on personal bankruptcy, contract disputes, builders’ liens, debt enforcement, employment law and personal injury. She also provides advice on residential landlord and tenant matters and wills and estates. \r","When she’s not at work Corey can be found listening to podcasts and Elvis Presley, or cooking. She also curls in a ladies league during the winter months."],"contact":"cdavison@milesdavison.com\r\n403.298.0304","education":["Thompson Rivers University, J.D.\r","Admitted to the Alberta Bar in 2017\r"],"experience":["Member, Law Society of Alberta \r","Member, Calgary Bar Association \r","Member, International Women’s Insolvency and Restructuring Confederation (IWIRC) \r","Member, Association of Women Lawyers \r","Member, Advocates Society\r","Member, Canadian Bar Association - Law Day Planning Committee \r"]},{"name":"JOHN E. DAVISON, Q.C.\r","position":"PARTNER","practice":"Civil Litigation, Family Law","bio":["John is an exceptional trial lawyer with experience at all levels of court.\r","John joined Miles Davison in 1971 and became a partner in 1975.\r","John’s areas of practice are in personal injury and insurance related litigation, criminal and matrimonial law, with particular emphasis on trial work. He has appeared before all levels of Court, including the Supreme Court of Canada.\r","When he’s not at work, John enjoys travelling to Australia to visit his grandchildren."],"contact":"jed@milesdavison.com\r\n403.298.0322\r\ndownload vCard","education":["University of Queen’s Law School, LL.B.\r","Admitted to the Alberta Bar in 1971\r"],"experience":["Appointed Queen’s Counsel 1998\r"]},{"name":"FREDERICK DENT\r","position":"PARTNER","practice":"Business Law","bio":["Fred has practised corporate and commercial law in Calgary since being admitted to the Alberta Bar in 1979 and has extensive international and domestic experience.\r","Fred is a meticulous lawyer who ensures his clients are not only well-served, but are served in a timely and cost-effective manner. \r","Fred's primary areas of practice include banking and finance, share and asset acquisitions, corporate reorganizations involving among other transactions, structuring and implementing long-term employee incentive plans, estate freezes and exit strategies for small business owners. He has represented energy services companies regarding corporate takeovers and drilling rig acquisitions in Columbia, Venezuela, Ecuador and Peru and has structured and implemented sale and lease transactions for oil and gas service equipment in Australia and the United States.\r","Fred has participated in many seminars and given papers and presentations to various lending institutions and professional groups in respect of structuring, documenting and securing financial transactions. \r","Outside of work, Fred is most likely engaged in some sort of physical activity, including skiing, tennis, hiking and yoga. He is married and is the proud father of two adult sons. Fred, his wife Tallis, and their sons have travelled extensively throughout Europe, Mexico and Central America and they are looking forward to charting new territory in the future."],"contact":"fdent@milesdavison.com\r\n403.298.0351\r\ndownload vCard","education":["University of Alberta, 1973, B.A. (Distinction)\r","University of Alberta, 1978, LL.B.\r","Admitted to the Alberta Bar in 1979\r"],"experience":["Member, Canadian Bar Association, Natural Resources Law Section\r","Member, Law Society of Alberta\r","Past Director, Oakridge Community Association\r","Past Member of Board of Directors, Distress Centre of Calgary\r","Past Member, Joint Law Society of Alberta/Canadian Bar Association Legislative Review Committee\r","Board of Directors and Secretary-Treasurer, Family H.A.T., A Community Foundation for Kids\r"]},{"name":"JANE EVENSON\r","position":"ASSOCIATE","practice":"Business Law, Wills & Estates, Real Estate","bio":["Jane is thoughtful and sensitive at working to resolve her clients’ legal matters.\r","Jane is an original thinker and supportive lawyer who helps her clients navigate the challenges of a legal problem or an opportunity in taking their next best leap. From start-ups to acquisitions, from expansions to wind-downs, through the good times and tough times, Jane is a valuable advisor for her clients at every stage of their journey.\r","Jane has extensive experience across the spectrum of business and commercial matters including: asset and share purchase/sale transactions, corporate reorganizations, joint ventures and partnerships, commercial contracts, secured transactions, commercial property leases, commercial and residential property purchases/sales. Jane also advises her clients on wills, estate planning and probate administration. \r","Jane has been a partner in a small law firm in Calgary since the beginning of her legal practice and is delighted to be part of the team at Miles Davison LLP. \r","Outside of the office, Jane is an avid skier, golfer, reader and always looks forward to being with her husband and three grown children who live in Calgary."],"contact":"jevenson@milesdavison.com\r\n403.298.0369\r\ndownload vCard","education":["Queen’s University BA (Hons) Political Studies\r","University of Windsor Law School LLB\r","Admitted to Ontario Bar 1985\r","Admitted to Alberta Bar 1986\r"],"experience":["Past Director – Vecova Centre for Disability Services and Research 2007-2015\r"]},{"name":"SEAN T. FITZGERALD\r","position":"PARTNER","practice":"Civil Litigation, Employment Law, Insolvency, Estate Litigation","bio":["Sean is committed to resolving his clients' legal issues in a timely and cost-effective manner.\r","Sean has a strongly-held belief that he best serves his clients with timely communication and by ensuring they understand the law and legal process. Sean’s clients benefit from his attention to detail and his passion and commitment to fulfil the needs and objectives of the clients he serves. \r","Sean is a partner at Miles Davison and is a member of the firm’s Executive Committee. Sean is a litigator with an emphasis on labour and employment (including wrongful dismissals), insolvency and collection matters, construction disputes, personal injury and estate litigation. Sean has considerable experience at all levels of the Alberta Courts and is well known by the Calgary Bar and Judiciary.\r","Outside the courtroom, Sean is a sports enthusiast, willing to try just about anything. He was a ski racer in his youth and still loves to ski, but switched to hockey and plays a few nights a week. Sean also loves to sail when weather and time permit. He and his family are long-time Calgary residents. \r","Sean has been actively involved in CBA activities including being an executive section member, has Chaired the Civil Litigation and the Insolvency sections of the CBA (Alberta branch) and is currently an executive member and Chair of the Labour and Employment section. Sean has twice been Section Coordinator for the CBA (a two-year position) and is serving on the CBA’s Engagement and Governance Task Forces. He is also a Council member of the CBA for Alberta.\r","Sean is a long-time volunteer for the Calgary Exhibition and Stampede, having Chaired the Youth, Speech and Debate Committee. He served on the Legal Assistant Advisory Committee for SAIT Polytechnic and was a sessional instructor for the Red Deer College and SAIT’s Legal Assistants’ Program. Sean was a long-standing director for the Grace-Bankview House Senior Citizens Residence Society."],"contact":"fitz@milesdavison.com\r\n403.298.0348\r\ndownload vCard","education":["University of Alberta, 1980, B.B.A, B.Comm. (Distinction)\r","University of Alberta, 1983, LL.B.\r","Admitted to the Alberta Bar in 1984\r"],"experience":["Member of the Law Society of Alberta\r","Member of the Alberta Civil Trial Lawyers’ Association of Alberta\r","Member of the Advocates’ Society\r"]},{"name":"WILLIAM M. (BILL) GRAY, Q.C.\r","position":"PARTNER","practice":"Business Law, Real Estate","bio":["Bill is a problem solver who works tirelessly on behalf of his clients to get deals done.\r","Bill conducts his practice with the core belief that there is a solution to every issue. His clients speak to his ability to guide complex issues to a resolution, and having helped corporations of all sizes and sectors through a variety of complex transactions, including mergers, acquisitions, and financing, Bill’s track record is a measure of his successful approach.\r","Whether closing a large cross-border transaction or providing general advice to start-up companies, Bill brings a wealth of experience and the same level of focus and attention to detail to every file he undertakes.\r","Bill is deeply involved in activities in the community: he is the Past President and remains on the Board of the Calgary Stampede and he sits on the boards for the Stampede Foundation, Saddledome Foundation and Quest Theatre, and on the advisory board of Vantage Foods. When he’s not attending to client cases or board duties, Bill likes to spend time on the links, particularly in Arizona."],"contact":"bgray@milesdavison.com\r\n403.266.7639\r\ndownload vCard","education":["University of Alberta Business School\r","University of Alberta Law School, LL.B.\r","Admitted to the Alberta Bar in 1978\r"],"experience":["Board member of Calgary Stampede, Stampede Foundation, Saddledome Foundation, Quest Theatre Society, and Vantage Foods\r","Past President Calgary Stampede\r","Received Queen’s Council designation from Province of Alberta in 2010\r"]},{"name":"ASHLEY HAHN\r","position":"ASSOCIATE","practice":"Estate Litigation, Civil Litigation, Insolvency, Employment Law","bio":["Ashley is a client-focused litigator whose passion is matched by her persistence.\r","Ashley approaches each case the same way. She single-mindedly pursues her goal of determining her client’s goals and then works to find the most effective way to achieve them. She is conscientious by nature, a trait which is amplified when it comes to serving her clients.\r","Ashley has a civil litigation practice which focuses on employment, security enforcement, estate litigation and personal bankruptcy matters. She has appeared before all levels of court in Alberta.\r","Outside of work, Ashley loves to hike, regularly exploring new trails around Kananaskis, Banff and Canmore. She is also an amateur foodie who loves exploring new cuisines."],"contact":"ahahn@milesdavison.com\r\n403.298.0335\r\ndownload vCard","education":["University of Alberta, LL.B.\r","Admitted to the Alberta Bar in 2012\r"],"experience":["Member, Canadian Bar Association — Insolvency Subsection Executive\r","Volunteer with Pro Bono Law Alberta\r","Member, International Women’s Insolvency and Restructuring Confederation (IWIRC)\r"]},{"name":"JASON J. IRWIN\r","position":"PARTNER","practice":"Civil Litigation, Employment Law","bio":["Jason is a thoughtful and tenacious litigator.\r","Jason’s deep knowledge of his field gives him the ability to provide timely advice to his clients, tailored to their specific needs. His persistent nature ensures no stone is left unturned helping to forge positive outcomes for his clients. \r","The primary focus of Jason’s practice is commercial litigation. He has dealt with a wide variety of civil disputes and matters involving employment, insurance, foreclosures, enforcement of security, construction, commercial leases, land use, collections and contractual matters. He has also appeared before all levels of the Alberta Courts. In addition to his litigation practice, Jason is also well-versed on matters including private equity and debt financings, contract review and preparation, corporate governance, privacy issues and the purchase/sale and development of commercial real estate. He currently serves as general counsel for a number of businesses and non-profits.\r","Jason is a family man, who puts a tremendous focus on the emotional and intellectual growth of his three children. Jason and his wife seek out new experiences for their family both locally and abroad, including camping, mountain biking and hiking. He is also a long-distance runner."],"contact":"jirwin@milesdavison.com\r\n403.298.0336\r\ndownload vCard","education":["University of Calgary, LL.B.\r","Admitted to the Alberta Bar in 2009\r"],"experience":["Director, Habitat for Humanity Southern Alberta, 2011-2016\r"]},{"name":"DANIEL K. JUKES \r","position":"PARTNER","practice":"Insolvency, Civil Litigation","bio":["Dan is a diligent and thorough litigator.\r","Dan graduated from law at the University of Calgary. He joined Miles Davison as an articling student and was called to the bar in 2007.\r","Dan's primary area of practice is bankruptcy and insolvency, but he still maintains a keen interest in general litigation. He has extensive experience acting for all stakeholders in both personal bankruptcy matters and corporate insolvencies (including receivership and CCAA proceedings). Dan has presented a number of papers dealing with insolvency topics for the Legal Education Society of Alberta and has presented on several occasions at the annual forum for the Canadian Association of Insolvency and Restructuring Professionals. \r","Outside of work, Dan enjoys a number of sports, including hockey, rugby, and soccer. He was born and raised in Calgary and is an avid Flames fan."],"contact":"djukes@milesdavison.com\r\n403.298.0327\r\ndownload vCard","education":["University of Calgary, LL.B.\r","Admitted to the Alberta Bar in 2007\r","\r","<>\r","TODD LEE\r","PARTNER / Civil Litigation, Employment Law\r","Todd builds trust with clients through hard work and timely communication.\r","As a lawyer, one of the skills Todd finds most valuable is an ability to listen. By listening well, he is able to provide honest, balanced advice that serves his clients. He believes that trust is earned by hard work, and timely and effective communication.\r","Todd’s general litigation practice focuses on insurance law, sports and recreation law, and employment law. He has also defended construction claims, product liability claims, and is regularly retained to provide coverage opinions. Todd is regularly retained to defend catastrophic personal injury claims. Todd has assisted multiple clients with the implementation of a robust and successful waiver of liability program in the area of sports and recreation.\r","When he’s not assisting clients, Todd can be found engaging in his two passions, sports and music. Before his law career, Todd was a musician who recorded and toured Canada. He still performs regularly with bands in Calgary and Toronto. When he’s not performing, he’s either on the golf course or lacing up his skates to play hockey.\r","Contact\r","todd.lee@milesdavison.com\r","403.298.0342\r","download vCard\r","Education\r","University of Alberta Law School, 1992, LL.B.\r","Admitted to the Alberta Bar in 1993\r"],"experience":["Director Association of Ski Defence Attorneys\r","Canada West Ski Areas Association\r"]},{"name":"PETER LEVEQUE\r","position":"PARTNER","practice":"Civil Litigation","bio":["Peter is a versatile lawyer with a wealth of experience.\r","Peter is a creative lawyer, who is easily able to see problems from new angles. He has a general litigation practice, with a focus on commercial disputes. During his considerable experience managing and resolving commercial cases, including construction and property disputes, leasing claims, employment disputes, intellectual property litigation and property development matters, he has been listed as counsel in over 70 reported decisions in all areas of the litigation practice.\r","Peter has appeared at all levels of court in Alberta, the Tax Court of Canada, Federal Court (Trial Division and Court of Appeal) and the Supreme Court of Canada as well as numerous regulatory tribunals, including the Securities Commission, Investment Industry Regulatory Organization of Canada, and the Law Society of Alberta. He has also participated in many arbitrations, mediations and other forms of alternative dispute resolution.\r","When he’s not working through the nuance of the law, Peter can be found cheering for the Flames or the Stampeders, reading, running, or spoiling his two grandsons."],"contact":"pleveque@milesdavison.com\r\n403.298.0392\r\ndownload vCard","education":["University of Calgary, J.D.\r","Admitted to the Alberta Bar in 1988\r","\r","<>\r","J. BYRON LOEWEN\r","PARTNER / Real Estate, Civil Litigation\r","Byron has a general litigation practice with a focus on real estate.\r","Byron’s focus area is on all matters related to real estate, but that’s not where his practice ends. In addition to helping clients sort through the fine print, Byron is also an adept litigator when it comes to matters of personal injury, employment law, insurance and foreclosure defence. Not one to let anything slip through the cracks, Byron has a keen eye for detail, and a deep well of experience that continually benefits his clients.\r","Byron’s practice focuses on real estate conveyancing and refinancing, both residential and commercial, personal injury litigation, and general corporate litigation. He has experience providing legal advice to a wide range of clients such as insurance companies, corporations, small businesses and injured individuals.\r","The only thing Byron loves more than sports is his family. Which is why when he’s not cheering for the Bluedevils, Cubs or Vikings, he can be found travelling with his wife and four kids. He also loves cooking with a focus on Cajun dishes. He is an avid reader, who enjoys non-fiction American history, Russian and Middle Eastern politics. \r","Contact\r","byronl@milesdavison.com\r","403.298.0363\r","download vCard\r","Education\r","University of Calgary, J.D.\r","Admitted to the Alberta Bar in 1998\r"],"experience":["Board of Management, Royal Oak Victory Church\r"]},{"name":"ADAM MAROFKE\r","position":"ASSOCIATE","practice":"Family Law, Civil Litigation","bio":["Adam focuses on helping his clients resolve issues so they can get back to their lives.\r","A highly compassionate and intuitive lawyer, Adam works hard to solve problems for his clients, advocating for them in the courtroom and outside of it. He helps his clients understand the parameters of their case, so realistic expectations are set from the get go.\r","Adam’s practice focuses on family law, and he has a range of experience including matters involving matrimonial property division, child support, spousal support, child custody disputes, mobility and child welfare. In addition, he also continues to maintain a general civil litigation practice. Adam has experience litigating matters in the courtroom, having appeared routinely in morning chambers, as well as having conducted trials in the Alberta Provincial Court’s Civil, Family and Criminal divisions, and the Alberta Court of Queen’s Bench. When court is not feasible, Adam also represents clients in alternative dispute resolution processes. \r","A born and raised Calgarian, when he’s not at work Adam can usually be found with his wife skiing and chasing powder in Revelstoke, Fernie or Lake Louise in the winter, and hiking in Kananaskis Country in the summer. His travels have also taken him to 27 countries across the globe."],"contact":"amarofke@milesdavison.com\r\n403.298.0328","education":["University of Calgary Law School, J.D.\r","Admitted to the Alberta Bar in 2016\r"],"experience":["Caseworker with Student Legal Assistance Trial Division\r","Volunteer with Pro Bono Students Canada\r","Legal Aid caseworker\r"]},{"name":"D. BLAIR MASON, Q.C.\r","position":"","practice":"The Honourable D. Blair Mason, Q.C. has retired, effective October 18, 2018.","bio":["As part of his long legal career, Blair practised as an agent of the Attorney General, and in general litigation, insurance law, family law and estate law before developing a practice in labour arbitration and mediation. He served as a vice chair of the Alberta Board of Industrial Relations, now the Alberta Labour Board, and as first Chair of the Public Service Employee Relations Board. Before his appointment to the Court, Blair also developed a practice in expropriation litigation and mediation during the acquisition by the Province of The Three Rivers Dam project in southern Alberta, Fish Creek Park in the City of Calgary, as well as several other expropriation matters. Blair was a founding partner and practised law for 28 years with the firm before his appointment as a Justice of the Queen’s Bench of Alberta.\r","Blair sat as a Justice of the Queen’s Bench Court for 23 years until his retirement in October of 2008. While on the Bench he was the judge on the “Baby M” case involving parental and adoption rights in Canada and related USA claims of parental rights, the construction dispute of Bankers Hall in the City of Calgary and a number of other high profile cases. After his retirement from the Court he was appointed the Chief of the Alberta Human Rights Commission serving from March 2009 to June 2014. He established the independence of the commission in appointments of Tribunal members, the conduct of the investigations, tribunal hearings and resolution of complaints with the introduction and establishment of a functioning mediation process as part of the Tribunal process."],"contact":"bmason@milesdavison.com\r\n403.298.0332","education":["University of Alberta, LL.B. \r","Admitted to the Alberta Bar in 1957\r"],"experience":["(shortlist)\r","International Commission of Jurists\r","Canadian Superior Judges Association\r","Mediator, Alberta Human Right Commission\r","Canadian Institute for the Administration of Justice\r","Director, Calgary Legal Guidance\r"]},{"name":"WARD A. MATHER\r","position":"PARTNER","practice":"Civil Litigation, Employment Law, Insolvency","bio":["Ward is determined to find effective legal solutions for his clients.\r","Ward is a partner at Miles Davison LLP. He joined the firm in 2002 as an articling student and became a partner in 2010.\r","Ward has extensive litigation experience and practises in dispute resolution, including areas of commercial and civil litigation, insurance defence, sport and adventure liability work, administrative law, employment law, debtor and creditor claims and security enforcement. Ward also acts as general counsel for privately held corporations, not-for-profit associations and national sport organizations.\r","Ward has appeared at all levels of Court in Alberta, has defended claims in the British Columbia Supreme Court and has represented amateur athletes before administrative tribunals including the Fédération Internationale De Natation (FINA) and the Court of Arbitration for Sport.\r","Outside of the office, Ward can be found cheering for the Edmonton Oilers, with his two children, or immersed in outdoor sports, including mountain biking, surfing, backcountry snowboarding and sledding."],"contact":"wmather@milesdavison.com\r\n403.298.0390\r\ndownload vCard","education":["University of Calgary Law School, LL.B.\r","Admitted to the Alberta Bar in 2003\r","\r","<>\r","JAMES D. MCFARLANE, Q.C. \r","PARTNER / Business Law, Real Estate\r","Jim is a hands-on lawyer who believes strong teams yield great results.\r","Jim’s meticulous approach to his work, combined with a knack for bringing together the people around him has helped him achieve great results for his clients.\r","Jim has practised primarily in banking law, representing major chartered banks and mezzanine lenders. He also represents corporate borrowers to ensure their financing requirements are realized. Having represented clients on both sides of commercial real estate and leasing transactions Jim brings a well-rounded approach, allowing him to achieve results in a timely, cost-effective manner.\r","Jim has been active in the Calgary soccer community, taking on both coaching and management roles for Calgary Minor Soccer Community select boys teams and Foothills FC club soccer. He enjoys golf, cross-country skiing, cycling, hiking and scuba diving, often incorporating these pursuits into his many travel adventures.\r","Contact\r","jmcfarlane@milesdavison.com\r","403.298.0319\r","download vCard\r","Education\r","University of Alberta, B.A., LL.B.\r","Admitted to the Alberta Bar in 1980\r"],"experience":["Appointed Queen's Counsel 2010\r","Past Director, Heritage Sports Association\r","Past Director, Calgary Foothills FC\r","Governor and Secretary, Rundle College Education Foundation\r"]},{"name":"RHONDA QUINTON\r","position":"ASSOCIATE","practice":"Wills & Estates","bio":["Rhonda compassionately helps her clients plan for an unknown future.\r","Contemplating the end of life is never easy. It’s why Rhonda undertakes every interaction with the utmost care, and a focus on collaboration. The planning she does means her clients’ families don’t have the added burden of deciding how family assets should be handled at the end of life. As Rhonda’s clients will attest, the first time they walk into her office it’s hard, but they always leave feeling lighter.\r","Rhonda was born and raised in Calgary, but her educational and work experiences have taken her to Europe and across Canada – after being called to the Bar in Alberta, she relocated to BC and was called to the BC Bar where she worked for 20 years before returning home to Calgary. During her time in Maple Ridge, BC she was actively involved in her community as a director of the Maple Ridge Arts Council, the Ridge Meadows Hospice Society and the Ridge Meadows Hospital Foundation. Rhonda is a mother of two who loves spending time with her kids on the ski hill and at the ball diamond. She is also an avid traveller and dog lover."],"contact":"rquinton@milesdavison.com\r\n403.201-2711\r\ndownload vCard","education":["Sir Winston Churchill High School, Calgary\r","Ecole Brillantmont, Lausanne, Switzerland\r","University of Western Ontario, London, Ontario\r","University of Victoria Law School, LL.B.\r","Admitted to the Alberta Bar in 1991\r","Admitted to the British Columbia Bar in 1993\r"],"experience":["Director Maple Ridge Arts Council\r","Director Maple Ridge Hospice Society\r","Director Maple Ridge Hospital Foundation\r","Member of the Southern Alberta Pioneers and Their Descendants\r","Member of the Calgary Winter Club\r"]},{"name":"BILL RANSON Q.C.\r","position":"ASSOCIATE","practice":"Wills & Estates, Business Law","bio":["Bill has extensive experience in the estate planning field which, in conjunction with certain training from the Canadian Institute of Chartered Accountants, makes him an invaluable asset to his clients.\r","Bill is an experienced advisor to executors and administrators of estates, and has established and advised many family trusts. While the majority of Bill’s practice focuses on wills and estates, he also works with corporate clients, advising them on start-ups and legislative requirements and changes.\r","Bill has practised law in Calgary since 1977 including five years as in-house tax counsel at Texaco Canada Resources. Since returning to private practice, Bill has advised on the structure of transactions between Canadian corporations and representatives in a number of other countries including, Iran, Gabon, Brazil, Egypt, Indonesia, Mexico, Australia and Cuba. He has experience in the structuring and reorganizing of corporations, owner-managed businesses, and partnerships.\r","When he’s not at work, Bill indulges his passion for cooking, using fresh, natural foods. He is an avid photographer and combined that interest with scuba diving to explore the art of underwater photography. Bill also loves spending time with his five grandchildren."],"contact":"wranson@milesdavison.com\r\n403.298.0383\r\ndownload vCard","education":["University of Calgary, B.A. Economics\r","Carleton University, B.Comm. (Honours)\r","University of Ottawa Law School, LL.B.\r","Admitted to the Alberta Bar in 1978\r"],"experience":["Appointed Queen’s Counsel in 2008\r","Member of the Calgary Estate Planning Council\r","Chair of SAIT Trojan Athletic Foundation Board\r","Founding Director and Past President, Country Hills Golf and Country Club\r","Past Chair of the Alberta Law Reform Legislative Review Committee\r","Past President, Calgary Winter Club Board of Directors\r"]},{"name":"CALVIN ROBB\r","position":"ASSOCIATE","practice":"Civil Litigation, Bankruptcy, Insolvency & Restructuring","bio":["Calvin excels at communicating and connecting with his clients.\r","Calvin is a talented and experienced lawyer who confidently helps his clients with collection issues, no matter how complicated. Calvin offers his clients an informed and positive approach to collection matters in every corner of Canada. Calvin’s lived experience and greatest insight comes from having been born and raised in Calgary. \r","With his connections and outstanding professional networks in this province and beyond, Calvin helps his clients understand the personalities, policies and contextual background related to every issue that crosses his desk. Calvin works in the area of debtor and creditor dispute resolution, retail and corporate collections and related litigation, builders’ liens and security enforcement.\r","For over 30 years, Calvin has been a partner in a small boutique law firm and is pleased to be at Miles Davison LLP.\r","Calvin is a talented raconteur with a keen sense of humour and a deep appreciation of Alberta, its history and its important role in Canada. In his spare time, Calvin loves to ski, golf, read current affairs, socialize with friends and spend time with his wife and three grown children who all live in Calgary."],"contact":"crobb@milesdavison.com\r\n403.298.0373\r\ndownload vCard","education":["University of Alberta B.Com\r","University of Windsor Law School LLB\r","Admitted to Alberta Bar 1984\r"],"experience":["The Canadian Institute – Presenter \r","SCORE Dormant Debt Conference – Presenter \r","Alberta Rules of Court Committee\r","Legal Education Society of Alberta – Panel Chair and Presenter \r"]},{"name":"CHARLIE SPENCE Q.C.\r","position":"ASSOCIATE","practice":"Business Law","bio":["A detailed approach makes Charlie a great fit in the corporate world.\r","Charlie joined Miles Davison in 1982 and became a partner in 1984. His thoughtful and thorough work serves his clients well in his primary areas of practice: corporate/commercial, oil and gas, banking and securities, including equity and debt financing, corporate and oil and gas divestitures and acquisitions, oil and gas contracts, interpretation and resolution of contract disputes, and enforcement of security.\r","Charlie’s broad knowledge of the corporate/commercial world led him to being a lecturer at Mount Royal College and the University of Calgary, and he has also presented papers on the enforcement of security, claims against oil and gas interests, and oil and gas acquisitions.\r","Outside of work, Charlie is an outdoor enthusiast – skiing in the winter and playing tennis and sailing when the warmer months roll around."],"contact":"cspence@milesdavison.com\r\n403.298.0300\r\ndownload vCard","education":["University of Toronto, 1974, B.Sc.\r","University of Windsor, 1977, LL.B.\r","Admitted to the Alberta Bar in 1978\r","Appointed Queen’s Counsel in the Province of Alberta in 2002\r"],"experience":["Member, Law Society of Alberta\r","Past Director, Southwest Athletic Association\r","Past Director, Calgary Contemporary Arts Society\r","Past Director, Petroleum Communication Foundation\r"]},{"name":"LAUREN TURNQUIST\r","position":"PARTNER","practice":"Family Law, Real Estate","bio":["Lauren is a collaborative, client-focused lawyer.\r","Lauren articled with Miles Davison in 2010 before joining the firm. She prides herself on efficiency and teamwork, a potent combination which allows her to exceed client expectations.\r","Lauren worked with the Real Estate Council of Alberta in the Audits and Investigation Department while attending law school, and now has a robust practice in both Family Law and Real Estate.\r","Lauren grew up playing softball and curling. Outside the office, Lauren spends her spare time at her family farm near Wetaskiwin, Alberta and with her rescue dog, Lily. Lauren and her husband love to travel and have spent time in India, Hong Kong, Ireland, Italy and Japan."],"contact":"lturnquist@milesdavison.com\r\n403.298.0355\r\ndownload vCard","education":["University of Calgary, B.A. (First Class Honours, Psychology) \r","University of Calgary, LL.B.\r","Admitted to the Alberta Bar in 2011\r"],"experience":["Volunteer: Calgary Stampede\r","Canadian Bar Association Mentorship Program\r","Committee Member, Howard Tidswell Teaching Excellence Award Committee\r","One-on-One Mentor at the Calgary Young Offender Centre \r"]},{"name":"JARED WIEBE\r","position":"PARTNER","practice":"Family Law","bio":["Jared provides support for families when they need it the most.\r","Jared’s experience in family law has taught him many lessons, but the lesson that continues to guide his practice most is that the needs of the children must be put first. It’s why he’ll always do his utmost to help clients reach a settlement, reducing the stress of litigation on all parties. Jared also places great importance on keeping his clients knowledgeable and informed of their options.\r","That philosophy, in conjunction with training as a mediator and a perpetually level head, makes him an incredible asset for families in stressful situations. Jared uses his skills and compassionate nature to help diffuse tense situations, allowing all parties to address sensitive matters with clarity, calmness and a focus on protecting children and assets. He has experience resolving all manner of disputes, from division of matrimonial property, custody and access to support payments. Although his focus is always on negotiating a settlement instead of heading to court, Jared is also an excellent litigator and has appeared at all levels of court in Alberta.\r","Being married with five children has greatly increased Jared's insight into family relationships and has honed his ability to help his clients manage issues related to the family. When Jared’s not serving his clients, he volunteers as a youth leader for the LDS church and plays in a band that performs at an annual Calgary lawyer’s charity battle of the bands."],"contact":"jwiebe@milesdavison.com\r\n403.298.0358\r\ndownload vCard","education":["Thomas M. Cooley Law School, J.D.\r","Admitted to the Alberta Bar in 2012\r"],"experience":["J. Reuben Clark Law Society\r","N. Eldon Tanner Management Society\r","Appeared in the Alberta Court of Appeal\r"]},{"name":"CURTIS WOLFF \r","position":"ASSOCIATE","practice":"Civil Litigation, Employment Law, Estate Litigation","bio":["Curtis understands the value of communication.\r","From the initial meeting to the courtroom and every step in between, Curtis aims to give his clients a voice – and keep them informed every step of the way.\r","Curtis joined Miles Davison in 2019 and maintains a broad civil litigation practice. He has experience in the areas of commercial and contractual disputes, debt enforcement, construction, family law, employment law and estate litigation. Although he strives to explore every avenue for resolving his clients’ issues in a timely and cost-effective manner, Curtis is a shrewd advocate with trial experience in both Provincial Court and the Court of Queen’s Bench.\r","Not one to waste a day, Curtis spends his summers on his bike exploring Calgary’s tremendous urban pathways and parks. His love for hiking has taken him from the Rocky Mountains to the Scottish Highlands and the jungles of Cambodia. When he’s not outside, Curtis can be found scoping out local venues for new music. His law school band plays once a year for charity."],"contact":"cwolff@milesdavison.com\r\n403.298.0337\r\ndownload vCard","education":[],"experience":["University of Calgary Law School, J.D.\r","Admitted to the Alberta Bar in 2019\r"]}]